#!/bin/env python
#1. В диапазоне натуральных чисел от 2 до 99 определить, сколько из них кратны каждому из чисел в диапазоне от 2 до 9.

"""
# 1 вариант (в лоб)
lst = [ i for i in range(2, 100)] # 2 .. 99
test_lst = [ [i,0] for i in range(2, 10)] # [2, 0] , [3, 0] .. [9, 0]

for elem in lst:
    for test_elem in test_lst:
        if elem % test_elem[0] == 0:
            test_elem[1] += 1

print(test_lst)

# """

# for 2 # 2 4 6 7 8 | 10 12 14 16 18 | ...      | 92 94 96 98 |                    -> 6 + 6 + ...   + 5                     -> 6 * 8 + 5 = 42 + 5 = 49
# for 3 # 3 6 9     | 12 15 18       | 21 23 27 | 30 33 36 39 | 42 45 47 49| ... | -> 3 + 3 + ....  + 4(30) + 4(60) + 4(90) -> 3 * 7 + 4 * 3 = 21 + 12 = 33
# for 4 # 4 8       | 12 16          | 20 24 28 | 32 36       | 40 44 48   | ... | -> 2 * 6 + 3(20) + 3(40) + 3(60) + 3(80) -> 2 * 6 + 3 * 4 = 24

"""
# 2 вариант
for i in range(2, 10):
    res = len(range(i, 100, i))
    print(f" for {i} is {res}")

# """

#"""
# 3 вариант
for i in range(2, 10):
    res = ((99 - i ) // i) + 1
    print(f" for {i} is {res}")
# """
